#### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Terraform Plan</summary>

```hcl
  # module.function_profile_async.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_session_manager_internal.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-weu-auth-sm-int-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.pub_session_manager_internal.module.service_bus.azurerm_role_assignment.topics["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|writer"] will be created
  + resource "azurerm_role_assignment" "topics" {
      + description                      = "This role allows managing the given topic"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "321ab3f4-344b-4672-ab5a-029a4a72c452"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_io_prof_async.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|io-session-notifications-sub|reader"] will be created
  + resource "azurerm_role_assignment" "subscriptions" {
      + description                      = "This role allows receiving messages from the given subscription"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c60e62e1-05cb-43d0-a958-9b75153184d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Receiver"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic/subscriptions/io-session-notifications-sub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_io_prof_async.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-topic|io-session-notifications-sub|reader"] will be destroyed
  # (because key ["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-topic|io-session-notifications-sub|reader"] is not in for_each map)
  - resource "azurerm_role_assignment" "subscriptions" {
      - description                            = "This role allows receiving messages from the given subscription" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-topic/subscriptions/io-session-notifications-sub/providers/Microsoft.Authorization/roleAssignments/2bf63c70-aaf5-7b6e-2aed-b7a9f8ab666a" -> null
      - name                                   = "2bf63c70-aaf5-7b6e-2aed-b7a9f8ab666a" -> null
      - principal_id                           = "c60e62e1-05cb-43d0-a958-9b75153184d2" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4f6d3b9b-027b-4f4c-9142-0e5a2a2247e0" -> null
      - role_definition_name                   = "Azure Service Bus Data Receiver" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-topic/subscriptions/io-session-notifications-sub" -> null
        # (3 unchanged attributes hidden)
    }

  # module.topic_io_auth.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|io-session-notifications-sub|owner"] will be created
  + resource "azurerm_role_assignment" "subscriptions" {
      + description                      = "This role allows managing the given subscription"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "912c0ba1-90b5-47eb-83f7-bf1e1294cd5c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic/subscriptions/io-session-notifications-sub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.topic_io_auth.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-topic|io-session-notifications-sub|owner"] will be destroyed
  # (because key ["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-topic|io-session-notifications-sub|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "subscriptions" {
      - description                            = "This role allows managing the given subscription" -> null
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-topic/subscriptions/io-session-notifications-sub/providers/Microsoft.Authorization/roleAssignments/46e7ce6c-3dd1-3f18-028b-793e92892447" -> null
      - name                                   = "46e7ce6c-3dd1-3f18-028b-793e92892447" -> null
      - principal_id                           = "912c0ba1-90b5-47eb-83f7-bf1e1294cd5c" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/090c5cfd-751d-490a-894a-3ce6f1109419" -> null
      - role_definition_name                   = "Azure Service Bus Data Owner" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-topic/subscriptions/io-session-notifications-sub" -> null
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 2 to destroy.

```

</details>
